tutorials/darcyFoam/flowOnly/heterogeneousPermeability/constant/phreeqcInput
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
    location    "constant";
    object      phreeqcInput;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
SOLUTION 0
	temp 25
	pH 3
	units mmol/kgw
	Ca 0.1 
	S 0.6457
	C 10 
END
# CELLS WITH CALCITE
SOLUTION 1-80
	temp 25
	pH 9.375
	units mmol/kgw
	Ca 0.1566
	S 1e-7
	C 0.2566
END
